# Brewfile - Organized by categories
# Generated for personal dotfiles configuration

# =============================================================================
# Core System Tools
# =============================================================================
brew "coreutils"          # GNU core utilities
brew "gnu-sed"             # GNU sed (better than macOS version)
brew "grep"                # GNU grep
brew "wget"                # Web downloader
brew "curl"                # Already included in macOS, but ensures latest
brew "ca-certificates"     # Certificate authorities

# =============================================================================
# Shell & Terminal Enhancement
# =============================================================================
brew "zsh-autosuggestions" # Fish-like autosuggestions for zsh
brew "starship"            # Cross-shell prompt
brew "fzf"                 # Fuzzy finder
brew "zoxide"              # Smart cd command

# =============================================================================
# Text Editors & Development Environment  
# =============================================================================
brew "neovim"              # Modern Vim
brew "tmux"                # Terminal multiplexer
cask "wezterm"             # Modern terminal emulator

# =============================================================================
# File Management & System Monitoring
# =============================================================================
brew "eza"                 # Modern ls replacement
brew "bat"                 # Cat with syntax highlighting  
brew "fd"                  # Find alternative
brew "ripgrep"             # Fast grep alternative
brew "tree"                # Directory tree viewer
brew "htop"                # Process viewer
brew "btop"                # Modern system monitor
brew "ncdu"                # Disk usage analyzer
brew "mc"                  # Midnight Commander file manager
brew "stow"                # Symlink farm manager (for dotfiles)

# =============================================================================
# Git & Version Control
# =============================================================================
brew "git"                 # Version control (if not using system git)
brew "gh"                  # GitHub CLI
brew "git-delta"           # Better git diff
brew "lazygit"             # Terminal UI for git

# =============================================================================
# Programming Languages & Runtime Management
# =============================================================================
# Python
brew "python@3.12"        # Python 3.12
brew "python@3.13"        # Python 3.13  
brew "pyenv"               # Python version management
brew "pyenv-virtualenv"    # Python virtual environment management
brew "poetry"              # Python dependency management

# Node.js
brew "nvm"                 # Node version manager
brew "yarn"                # Package manager

# Go
brew "go"                  # Go programming language

# Rust  
brew "rustup"              # Rust toolchain installer
brew "sccache"             # Compiler cache for Rust/C++

# Deno
brew "deno"                # Modern JavaScript/TypeScript runtime

# =============================================================================
# Cloud & DevOps Tools
# =============================================================================
brew "awscli"              # AWS CLI
cask "gcloud-cli"          # Google Cloud CLI  
cask "google-cloud-sdk"    # Google Cloud SDK
brew "docker-compose"      # Docker Compose
brew "lazydocker"          # Docker terminal UI
brew "podman"              # Container engine
brew "helm"                # Kubernetes package manager
brew "k9s"                 # Kubernetes CLI
brew "tfenv"               # Terraform version manager
brew "tflint"              # Terraform linter
brew "golang-migrate"      # Database migration tool

# =============================================================================
# Databases & Data Tools  
# =============================================================================
brew "duckdb"              # Analytical database
brew "sqlite"              # SQL database engine
brew "libpq"               # PostgreSQL client library

# =============================================================================
# Build Tools & Dependencies
# =============================================================================
brew "autoconf"            # Build tool
brew "m4"                  # Macro processor
brew "pkgconf"             # Package configuration
brew "protobuf"            # Protocol buffers
brew "flatbuffers"         # Serialization library

# =============================================================================
# Productivity Applications
# =============================================================================
cask "raycast"             # Productivity launcher
cask "notion"              # Note-taking and organization
cask "notion-calendar"     # Calendar app
cask "todoist"             # Task management
brew "todoist-cli"         # Todoist command line
cask "1password"           # Password manager
cask "cleanshot"           # Screenshot tool
cask "bettertouchtool"     # Input customization
cask "granola"             # Display brightness control

# =============================================================================
# Communication & Collaboration
# =============================================================================
cask "slack"               # Team communication
cask "zoom"                # Video conferencing
cask "linear-linear"       # Project management

# =============================================================================
# Web Browsers
# =============================================================================  
cask "google-chrome"       # Chrome browser
cask "arc"                 # Arc browser
cask "vivaldi"             # Vivaldi browser  
cask "orion"               # Orion browser

# =============================================================================
# Document & PDF Tools
# =============================================================================
cask "pdf-expert"          # PDF editor
cask "anki"                # Spaced repetition learning

# =============================================================================
# Utilities & Libraries
# =============================================================================
# Compression
brew "lz4"                 # Fast compression
brew "zstd"                # Compression algorithm
brew "xz"                  # Compression utility

# Networking & Security
brew "rclone"              # Cloud storage sync
brew "openssl@3"           # Cryptography library
brew "krb5"                # Kerberos authentication
brew "libssh2"             # SSH2 client library

# Image Processing
brew "jpeg-turbo"          # JPEG library
brew "libtiff"             # TIFF library  
brew "little-cms2"         # Color management

# Text Processing & Unicode
brew "libunistring"        # Unicode string library
brew "utf8proc"            # Unicode processing
brew "pcre2"               # Perl Compatible Regular Expressions
brew "oniguruma"           # Regular expression library
brew "icu4c@77"            # Unicode support

# Development Libraries
brew "abseil"              # C++ library
brew "libevent"            # Event notification library
brew "libuv"               # Asynchronous I/O library
brew "libgit2"             # Git library
brew "libidn2"             # Internationalized domain names
brew "gettext"             # Internationalization
brew "gmp"                 # Arbitrary precision arithmetic
brew "mpdecimal"           # Decimal arithmetic
brew "certifi"             # Certificate bundle
brew "cffi"                # Foreign Function Interface
brew "pycparser"           # C parser

# Terminal & Editor Libraries  
brew "ncurses"             # Terminal handling
brew "readline"            # Line editing
brew "tree-sitter"         # Parser generator
brew "luajit"              # Just-In-Time compiler for Lua
brew "luv"                 # Lua bindings for libuv
brew "lpeg"                # Pattern matching for Lua
brew "unibilium"           # Terminfo library

# GitHub Actions
brew "act"                 # Run GitHub Actions locally

# Cargo/Rust Tools
brew "cargo-instruments"   # Profiling for Rust on macOS